#include "widget.h"
#include "ui_widget.h"
#include <QGraphicsView>
#include <QGraphicsScene>
#include <QGraphicsPixmapItem>
#include <QAudioFormat>
#include <QAudioSource>
#include <QMediaDevices>
#include <QFile>
#include<QMenu>
#include <QDebug>
#include<QSlider>
#include <QComboBox>
#include <QDial>
#include <QAudioOutput>
#include <QMediaPlayer>

int KeyBoardItem::getNoteFromKey(int key)
{
    switch(key)
    {
        // QWERTY行（白键）
    case Qt::Key_Q: return 60; // C4
    case Qt::Key_W: return 62; // D4
    case Qt::Key_E: return 64; // E4
    case Qt::Key_R: return 65; // F4
    case Qt::Key_T: return 67; // G4
    case Qt::Key_Y: return 69; // A4
    case Qt::Key_U: return 71; // B4
    case Qt::Key_I: return 72; // C5
    case Qt::Key_O: return 74; // D5
    case Qt::Key_P: return 76; // E5

        // 数字行（黑键）
    case Qt::Key_2: return 61; // C#4
    case Qt::Key_3: return 63; // D#4
    case Qt::Key_5: return 66; // F#4
    case Qt::Key_6: return 68; // G#4
    case Qt::Key_7: return 70; // A#4
    case Qt::Key_9: return 73; // C#5
    case Qt::Key_0: return 75; // D#5

        // ZXCV行（白键）
    case Qt::Key_Z: return 48; // C3
    case Qt::Key_X: return 50; // D3
    case Qt::Key_C: return 52; // E3
    case Qt::Key_V: return 53; // F3
    case Qt::Key_B: return 55; // G3
    case Qt::Key_N: return 57; // A3
    case Qt::Key_M: return 59; // B3
    case Qt::Key_Comma: return 60; // C4
    case Qt::Key_Period: return 62; // D4
    case Qt::Key_Slash: return 64; // E4

        // ASDF行（黑键）
    case Qt::Key_S: return 49; // C#3
    case Qt::Key_D: return 51; // D#3
    case Qt::Key_G: return 54; // F#3
    case Qt::Key_H: return 56; // G#3
    case Qt::Key_J: return 58; // A#3
    case Qt::Key_L: return 61; // C#4
    case Qt::Key_Semicolon: return 63; // D#4

        // 无效按键
    default: return -1;
    }
}
KeyBoardItem::KeyBoardItem(std::shared_ptr<VirtualKeyboard> myBoard_):myBoard(myBoard_){}

PianoKeyItem2::PianoKeyItem2(const QRectF &rect, bool isWhiteKey, std::shared_ptr<VirtualKeyboard> myBoard_)
    : QGraphicsRectItem(rect)
{
    normalColor = Qt::transparent;
    pressColor = isWhiteKey ? QColor(201, 199, 200, 100) : QColor(0, 0, 0, 150);
    setBrush(normalColor);
    setPen(Qt::NoPen);
    setAcceptedMouseButtons(Qt::LeftButton);
    setZValue(isWhiteKey ? 1 : 2);
    myBoard=myBoard_;
}

// 假设采样率 48000、通道数 2、采样格式 Float（对应 32 位）
